src/isos101/KBe21isos201retStoryOfScienceComputationalComplexity.org
#+TITLE: Story of Science: Computational Complexity Theory
#+CONTEXT: 21ISOS201
#+AUTHOR: Albert H
* sources
** gentle introductions
*** https://en.wikipedia.org/wiki/Computational_complexity_theory
*** https://complexityzoo.net/Petting_Zoo
*** https://www.simonsfoundation.org/2013/12/13/richard-karp/
* overview
** computational complexity theory studies how "difficult" a problem is
*** importantly, not how "good" an algorithm is... this field deals with all algorithms that solve a given problem
** key concepts
*** types of problems
*** Turing machines
*** reducibility
*** complexity classes
*** hierarchy
** key problems
*** P vs NP
* richard karp (the actual assignment)
** overview
*** basically, see https://www.simonsfoundation.org/2013/12/13/richard-karp/
** TODO storyboard richard karp life
* vocab and definitions                                                 :def:
** DTM, deterministic Turing machine
   A Turing machine with one infinite tape and a state function that has exactly one output for each (tape value, machine state) input. (Not a formal definition).
* complexity classes
** P
   Problems that can be solved in polynomial time using a deterministic Turing machine (DTM). These problems are generally considered "tractable" by the Cobham-Edmonds thesis.

   In practice, problems with large-degree solutions usually have smaller-degree solutions discovered later, so the division between P and other problems 'has turned out to be somewhat "natural"'.

   Examples: { graph reachability (whether two nodes are in the same component), 2SAT (SCC :)), matrix multiplication }
** NP
   Problems that can be checked "yes" in polynomial time. For example, graph isomorphism.
