docs/isos/intro_to_isos/KBe21isos201retStoryOfScienceComputationalComplexity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-02 Sat 12:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Story of Science: Computational Complexity Theory</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Albert H" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Story of Science: Computational Complexity Theory</h1> <h2 class="subtitle"></h2> <span class="author">Albert H</span> <span class="date">2021-10-02 Sat 10:58</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#orgf102f74">1. sources</a>
<ul>
<li><a href="#org7011cd6">1.1. gentle introductions</a>
<ul>
<li><a href="#org6965ad1">1.1.1. https://en.wikipedia.org/wiki/Computational_complexity_theory</a></li>
<li><a href="#orgd299bbf">1.1.2. https://complexityzoo.net/Petting_Zoo</a></li>
<li><a href="#org6cedb81">1.1.3. https://www.simonsfoundation.org/2013/12/13/richard-karp/</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf72ab37">2. overview</a>
<ul>
<li><a href="#org58fd3bf">2.1. computational complexity theory studies how "difficult" a problem is</a>
<ul>
<li><a href="#orgf75cdcb">2.1.1. importantly, not how "good" an algorithm is&#x2026; this field deals with all algorithms that solve a given problem</a></li>
</ul>
</li>
<li><a href="#orgc46bb20">2.2. key concepts</a>
<ul>
<li><a href="#org6235fb7">2.2.1. types of problems</a></li>
<li><a href="#orgd37abf5">2.2.2. Turing machines</a></li>
<li><a href="#org0c6c717">2.2.3. reducibility</a></li>
<li><a href="#org538fd56">2.2.4. complexity classes</a></li>
<li><a href="#org437d470">2.2.5. hierarchy</a></li>
</ul>
</li>
<li><a href="#orgf506bcb">2.3. key problems</a>
<ul>
<li><a href="#orge35e845">2.3.1. P vs NP</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org26697b6">3. richard karp (the actual assignment)</a>
<ul>
<li><a href="#org4d6ba0e">3.1. overview</a>
<ul>
<li><a href="#org06a524a">3.1.1. basically, see https://www.simonsfoundation.org/2013/12/13/richard-karp/</a></li>
</ul>
</li>
<li><a href="#orgdb1bbfb">3.2. <span class="todo TODO">TODO</span> storyboard richard karp life</a></li>
</ul>
</li>
<li><a href="#org7fe897f">4. vocab and definitions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="def">def</span></span></a>
<ul>
<li><a href="#orgb61cf41">4.1. DTM, deterministic Turing machine</a></li>
</ul>
</li>
<li><a href="#org0b2a838">5. complexity classes</a>
<ul>
<li><a href="#org20303ab">5.1. P</a></li>
<li><a href="#orgbe4c8b0">5.2. NP</a>
<ul>
<li><a href="#org3a3882d">5.2.1. whats up with coNP? checkin "no"??&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span></a></li>
</ul>
</li>
<li><a href="#org7819f72">5.3. NP-complete</a></li>
<li><a href="#org3266cb9">5.4. PH (polynomial hierarchy?)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span></a></li>
<li><a href="#orgb20344f">5.5. PSPACE</a></li>
<li><a href="#orga01c403">5.6. EXP</a></li>
<li><a href="#orgc21e3c6">5.7. AC<sup>0</sup>, NC<sup>0</sup>, NC</a></li>
<li><a href="#orgea57a74">5.8. L</a></li>
<li><a href="#org52dbc5c">5.9. P/poly</a></li>
<li><a href="#orgaed2ff7">5.10. BPP</a></li>
</ul>
</li>
<li><a href="#orge625dde">6. flows</a>
<ul>
<li><a href="#orgbfd6b3d">6.1. Wikipedia computational complexity theory</a>
<ul>
<li><a href="#org74d9152">6.1.1. computational problems</a></li>
<li><a href="#org2871f8d">6.1.2. machine models and complexity measures</a></li>
<li><a href="#orgdc457ae">6.1.3. complexity classes</a></li>
<li><a href="#org8b3d2da">6.1.4. important open problems</a></li>
<li><a href="#org7c8521e">6.1.5. Intractability</a></li>
<li><a href="#org86af396">6.1.6. continuous complexity theory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span></a></li>
<li><a href="#orga6f535a">6.1.7. History</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div></div>
</div>
<div id="outline-container-orgf102f74" class="outline-2">
<h2 id="orgf102f74"><span class="section-number-2">1</span> sources</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7011cd6" class="outline-3">
<h3 id="org7011cd6"><span class="section-number-3">1.1</span> gentle introductions</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6965ad1" class="outline-4">
<h4 id="org6965ad1"><span class="section-number-4">1.1.1</span> <a href="https://en.wikipedia.org/wiki/Computational_complexity_theory">https://en.wikipedia.org/wiki/Computational_complexity_theory</a></h4>
</div>
<div id="outline-container-orgd299bbf" class="outline-4">
<h4 id="orgd299bbf"><span class="section-number-4">1.1.2</span> <a href="https://complexityzoo.net/Petting_Zoo">https://complexityzoo.net/Petting_Zoo</a></h4>
</div>
<div id="outline-container-org6cedb81" class="outline-4">
<h4 id="org6cedb81"><span class="section-number-4">1.1.3</span> <a href="https://www.simonsfoundation.org/2013/12/13/richard-karp/">https://www.simonsfoundation.org/2013/12/13/richard-karp/</a></h4>
</div>
</div>
</div>
<div id="outline-container-orgf72ab37" class="outline-2">
<h2 id="orgf72ab37"><span class="section-number-2">2</span> overview</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org58fd3bf" class="outline-3">
<h3 id="org58fd3bf"><span class="section-number-3">2.1</span> computational complexity theory studies how "difficult" a problem is</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgf75cdcb" class="outline-4">
<h4 id="orgf75cdcb"><span class="section-number-4">2.1.1</span> importantly, not how "good" an algorithm is&#x2026; this field deals with all algorithms that solve a given problem</h4>
</div>
</div>
<div id="outline-container-orgc46bb20" class="outline-3">
<h3 id="orgc46bb20"><span class="section-number-3">2.2</span> key concepts</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org6235fb7" class="outline-4">
<h4 id="org6235fb7"><span class="section-number-4">2.2.1</span> types of problems</h4>
</div>
<div id="outline-container-orgd37abf5" class="outline-4">
<h4 id="orgd37abf5"><span class="section-number-4">2.2.2</span> Turing machines</h4>
</div>
<div id="outline-container-org0c6c717" class="outline-4">
<h4 id="org0c6c717"><span class="section-number-4">2.2.3</span> reducibility</h4>
</div>
<div id="outline-container-org538fd56" class="outline-4">
<h4 id="org538fd56"><span class="section-number-4">2.2.4</span> complexity classes</h4>
</div>
<div id="outline-container-org437d470" class="outline-4">
<h4 id="org437d470"><span class="section-number-4">2.2.5</span> hierarchy</h4>
</div>
</div>
<div id="outline-container-orgf506bcb" class="outline-3">
<h3 id="orgf506bcb"><span class="section-number-3">2.3</span> key problems</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orge35e845" class="outline-4">
<h4 id="orge35e845"><span class="section-number-4">2.3.1</span> P vs NP</h4>
</div>
</div>
</div>
<div id="outline-container-org26697b6" class="outline-2">
<h2 id="org26697b6"><span class="section-number-2">3</span> richard karp (the actual assignment)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4d6ba0e" class="outline-3">
<h3 id="org4d6ba0e"><span class="section-number-3">3.1</span> overview</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org06a524a" class="outline-4">
<h4 id="org06a524a"><span class="section-number-4">3.1.1</span> basically, see <a href="https://www.simonsfoundation.org/2013/12/13/richard-karp/">https://www.simonsfoundation.org/2013/12/13/richard-karp/</a></h4>
</div>
</div>
<div id="outline-container-orgdb1bbfb" class="outline-3">
<h3 id="orgdb1bbfb"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> storyboard richard karp life</h3>
</div>
</div>
<div id="outline-container-org7fe897f" class="outline-2">
<h2 id="org7fe897f"><span class="section-number-2">4</span> vocab and definitions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="def">def</span></span></h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb61cf41" class="outline-3">
<h3 id="orgb61cf41"><span class="section-number-3">4.1</span> DTM, deterministic Turing machine</h3>
<div class="outline-text-3" id="text-4-1">
<p>
A Turing machine with one infinite tape and a state function that has exactly one output for each (tape value, machine state) input. (Not a formal definition).
</p>
</div>
</div>
</div>
<div id="outline-container-org0b2a838" class="outline-2">
<h2 id="org0b2a838"><span class="section-number-2">5</span> complexity classes</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org20303ab" class="outline-3">
<h3 id="org20303ab"><span class="section-number-3">5.1</span> P</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Problems that can be solved in polynomial time using a deterministic Turing machine (DTM). These problems are generally considered "tractable" by the Cobham-Edmonds thesis.
</p>

<p>
In practice, problems with large-degree solutions usually have smaller-degree solutions discovered later, so the division between P and other problems 'has turned out to be somewhat "natural"'.
</p>

<p>
Examples: { graph reachability (whether two nodes are in the same component), 2SAT (SCC :)), matrix multiplication }
</p>
</div>
</div>
