docs/isos/intro_to_isos/KBe21isos201retStoryOfScienceComputationalComplexity.tex
% Created 2021-09-12 Sun 22:49
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Albert H}
\date{\today}
\title{Story of Science: Computational Complexity Theory}
\hypersetup{
 pdfauthor={Albert H},
 pdftitle={Story of Science: Computational Complexity Theory},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{sources}
\label{sec:org661d421}
\subsection{gentle introductions}
\label{sec:org7bf2f0b}
\subsubsection{\url{https://en.wikipedia.org/wiki/Computational\_complexity\_theory}}
\label{sec:orge9cda0d}
\subsubsection{\url{https://complexityzoo.net/Petting\_Zoo}}
\label{sec:orgc2b2d26}
\subsubsection{\url{https://www.simonsfoundation.org/2013/12/13/richard-karp/}}
\label{sec:org504a7f5}
\section{overview}
\label{sec:org7054b06}
\subsection{computational complexity theory studies how "difficult" a problem is}
\label{sec:org302a53f}
\subsubsection{importantly, not how "good" an algorithm is\ldots{} this field deals with all algorithms that solve a given problem}
\label{sec:orgac8e1a6}
\subsection{key concepts}
\label{sec:orgd00a3b1}
\subsubsection{types of problems}
\label{sec:orgce0473e}
\subsubsection{Turing machines}
\label{sec:org636cb1d}
\subsubsection{reducibility}
\label{sec:orgb1eb401}
\subsubsection{complexity classes}
\label{sec:org1b4bbc3}
\subsubsection{hierarchy}
\label{sec:orga6ff1fe}
\subsection{key problems}
\label{sec:org4dfce2e}
\subsubsection{P vs NP}
\label{sec:org116ed9b}
\section{richard karp (the actual assignment)}
\label{sec:orgd82b578}
\subsection{overview}
\label{sec:orgf63d4af}
\subsubsection{basically, see \url{https://www.simonsfoundation.org/2013/12/13/richard-karp/}}
\label{sec:org9b61f9d}
\subsection{{\bfseries\sffamily TODO} storyboard richard karp life}
\label{sec:org66b2513}
\section{vocab and definitions\hfill{}\textsc{def}}
\label{sec:org47a8ced}
\subsection{DTM, deterministic Turing machine}
\label{sec:org49d451e}
A Turing machine with one infinite tape and a state function that has exactly one output for each (tape value, machine state) input. (Not a formal definition).
\section{complexity classes}
\label{sec:org12bb0b8}
\subsection{P}
\label{sec:org2c10e56}
Problems that can be solved in polynomial time using a deterministic Turing machine (DTM). These problems are generally considered "tractable" by the Cobham-Edmonds thesis.

In practice, problems with large-degree solutions usually have smaller-degree solutions discovered later, so the division between P and other problems 'has turned out to be somewhat "natural"'.

Examples: \{ graph reachability (whether two nodes are in the same component), 2SAT (SCC :)), matrix multiplication \}
