src/isos101/KBe21isos201retStoryOfScienceComputationalComplexity.org
*** whats up with coNP? checkin "no"??                             :toexpand:
** NP-complete
   Problems that are complete for NP, aka. problems in NP that all other NP problems can be reduced to in polynomial time. One example is CircuitSAT: any NP problem can be reduced to CircuitSAT and any problem that CircuitSAT can be reduced to is also NP-complete. Showing that CircuitSAT or any other NP-complete problem can be solved in polynomial time implies that P = NP.

   Examples: TSP, SAT
** PH (polynomial hierarchy?)                                      :toexpand:
   Defined as the union of a set of recursively defined classes... something? Something about P and NP and oracles about NP and coNP. This is the thing that would collapse, I guess. Eg, why people don't think Graph Isomorphism is NP-complete.
** PSPACE
   Restricts space instead of time. This class is very large, and includes the entirety of NP (brute force check all possible proofs) and also PP and P^{#P}, apparently.

   Notable PSPACE-complete examples: QBF (or QSAT), deciding the winner of eg. Go.
** EXP
   run-time bounded by $2^{p(n)}$ where $p$ is a polynomial (ig). EXP is generally big enough: it contains PSPACE, the polynomial hierarchy (PH), and 'most problems we ever hope to attack'. Of course, there are bigger ones.
** AC^0, NC^0, NC
   small classes that have to do with circuit complexity.. generally the represent problems that can be solved quickly with massive parallelism.
** L
   Logarithmic space (logarithmic spaces on the Turing machine tape). This is nice because space is usually limited. L is contained within P because something about deterministic Turing machines?.
** P/poly
   polynomial time algorithms that solve a problem given an advice string which is at most polynomial in length and a function only of the input size. P/exp would make all problems trivial (provide a lookup table), but P/poly is actually interesting, ig. P/poly contains P, so $NP \notin P/poly$ would imply $P \neq NP$.
** BPP
   Randomized algorithms where the error rate is 'bounded by a constant'. Error rate could be improved by running the algorithm more times and taking a majority vote.

   AKS primality test made a previously randomized algorithm deterministic, which was a 'key example of derandomization'. People apparently think that P = BPP (and this is an important open problem).
* flows
** Wikipedia computational complexity theory
*** computational problems
**** problem instances
	 A problem describes the problem. the actual "numbers" that describe a specific problem is called a problem instance. sorting a list is a problem, sorting /this/ list is a problem instance.
**** representing problem instances
	 formally strings of characters from alphabets. The input size is the length of the string. Different representations can be chosen but it should be trivial (fast) to convert from one to the other.
**** decision problems (most basic type)
	 Generally, given an input, the output is either yes (accept) or no (reject). For example, deciding whether a graph is connected or not.
***** it can be thought of as a "formal language"                  :toexpand:
**** function problems
	 Very general: a function problem 'is a computational problem where a single output (of a total function) is expected for every input, but the output is more complex than that of a decision problem'. Basically calculate a non-binary function.

	 Examples: traveling salesman, integer factorization.

	 However, all function problems can be modeled as decision problems: For some function $f(*args) \to ans$, it can be modeled as the decision problem of whether $(*args, ans)$ is a valid output.
***** but does this really work? how can a decision TM be used to compute the function output efficiently? :toexpand:
