docs/isos/intro_to_isos/KBe21isos201retStoryOfScienceComputationalComplexity.html
<div id="outline-container-orgbe4c8b0" class="outline-3">
<h3 id="orgbe4c8b0"><span class="section-number-3">5.2</span> NP</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Problems that can be checked "yes" in polynomial time. For example, graph isomorphism.
</p>
</div>
<div id="outline-container-org3a3882d" class="outline-4">
<h4 id="org3a3882d"><span class="section-number-4">5.2.1</span> whats up with coNP? checkin "no"??&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span></h4>
</div>
</div>
<div id="outline-container-org7819f72" class="outline-3">
<h3 id="org7819f72"><span class="section-number-3">5.3</span> NP-complete</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Problems that are complete for NP, aka. problems in NP that all other NP problems can be reduced to in polynomial time. One example is CircuitSAT: any NP problem can be reduced to CircuitSAT and any problem that CircuitSAT can be reduced to is also NP-complete. Showing that CircuitSAT or any other NP-complete problem can be solved in polynomial time implies that P = NP.
</p>

<p>
Examples: TSP, SAT
</p>
</div>
</div>
<div id="outline-container-org3266cb9" class="outline-3">
<h3 id="org3266cb9"><span class="section-number-3">5.4</span> PH (polynomial hierarchy?)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span></h3>
<div class="outline-text-3" id="text-5-4">
<p>
Defined as the union of a set of recursively defined classes&#x2026; something? Something about P and NP and oracles about NP and coNP. This is the thing that would collapse, I guess. Eg, why people don't think Graph Isomorphism is NP-complete.
</p>
</div>
</div>
<div id="outline-container-orgb20344f" class="outline-3">
<h3 id="orgb20344f"><span class="section-number-3">5.5</span> PSPACE</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Restricts space instead of time. This class is very large, and includes the entirety of NP (brute force check all possible proofs) and also PP and P<sup>#P</sup>, apparently.
</p>

<p>
Notable PSPACE-complete examples: QBF (or QSAT), deciding the winner of eg. Go.
</p>
</div>
</div>
<div id="outline-container-orga01c403" class="outline-3">
<h3 id="orga01c403"><span class="section-number-3">5.6</span> EXP</h3>
<div class="outline-text-3" id="text-5-6">
<p>
run-time bounded by \(2^{p(n)}\) where \(p\) is a polynomial (ig). EXP is generally big enough: it contains PSPACE, the polynomial hierarchy (PH), and 'most problems we ever hope to attack'. Of course, there are bigger ones.
</p>
</div>
</div>
<div id="outline-container-orgc21e3c6" class="outline-3">
<h3 id="orgc21e3c6"><span class="section-number-3">5.7</span> AC<sup>0</sup>, NC<sup>0</sup>, NC</h3>
<div class="outline-text-3" id="text-5-7">
<p>
small classes that have to do with circuit complexity.. generally the represent problems that can be solved quickly with massive parallelism.
</p>
</div>
</div>
<div id="outline-container-orgea57a74" class="outline-3">
<h3 id="orgea57a74"><span class="section-number-3">5.8</span> L</h3>
<div class="outline-text-3" id="text-5-8">
<p>
Logarithmic space (logarithmic spaces on the Turing machine tape). This is nice because space is usually limited. L is contained within P because something about deterministic Turing machines?.
</p>
</div>
</div>
<div id="outline-container-org52dbc5c" class="outline-3">
<h3 id="org52dbc5c"><span class="section-number-3">5.9</span> P/poly</h3>
<div class="outline-text-3" id="text-5-9">
<p>
polynomial time algorithms that solve a problem given an advice string which is at most polynomial in length and a function only of the input size. P/exp would make all problems trivial (provide a lookup table), but P/poly is actually interesting, ig. P/poly contains P, so \(NP \notin P/poly\) would imply \(P \neq NP\).
</p>
</div>
</div>
<div id="outline-container-orgaed2ff7" class="outline-3">
<h3 id="orgaed2ff7"><span class="section-number-3">5.10</span> BPP</h3>
<div class="outline-text-3" id="text-5-10">
<p>
Randomized algorithms where the error rate is 'bounded by a constant'. Error rate could be improved by running the algorithm more times and taking a majority vote.
</p>

<p>
AKS primality test made a previously randomized algorithm deterministic, which was a 'key example of derandomization'. People apparently think that P = BPP (and this is an important open problem).
</p>
</div>
</div>
</div>
<div id="outline-container-orge625dde" class="outline-2">
<h2 id="orge625dde"><span class="section-number-2">6</span> flows</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgbfd6b3d" class="outline-3">
<h3 id="orgbfd6b3d"><span class="section-number-3">6.1</span> Wikipedia computational complexity theory</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org74d9152" class="outline-4">
<h4 id="org74d9152"><span class="section-number-4">6.1.1</span> computational problems</h4>
<div class="outline-text-4" id="text-6-1-1">
</div>
<ol class="org-ol">
<li><a id="orgd726d0e"></a>problem instances<br />
<div class="outline-text-5" id="text-6-1-1-1">
<p>
A problem describes the problem. the actual "numbers" that describe a specific problem is called a problem instance. sorting a list is a problem, sorting <i>this</i> list is a problem instance.
</p>
</div>
</li>
<li><a id="orge6e776c"></a>representing problem instances<br />
<div class="outline-text-5" id="text-6-1-1-2">
<p>
formally strings of characters from alphabets. The input size is the length of the string. Different representations can be chosen but it should be trivial (fast) to convert from one to the other.
</p>
</div>
</li>
<li><a id="orga89bf72"></a>decision problems (most basic type)<br />
<div class="outline-text-5" id="text-6-1-1-3">
<p>
Generally, given an input, the output is either yes (accept) or no (reject). For example, deciding whether a graph is connected or not.
</p>
</div>
<ol class="org-ol">
<li><a id="orgad95426"></a>it can be thought of as a "formal language"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span><br /></li>
</ol>
</li>
<li><a id="orge3a5081"></a>function problems<br />
<div class="outline-text-5" id="text-6-1-1-4">
<p>
Very general: a function problem 'is a computational problem where a single output (of a total function) is expected for every input, but the output is more complex than that of a decision problem'. Basically calculate a non-binary function.
</p>

<p>
Examples: traveling salesman, integer factorization.
</p>

<p>
However, all function problems can be modeled as decision problems: For some function \(f(*args) \to ans\), it can be modeled as the decision problem of whether \((*args, ans)\) is a valid output.
</p>
</div>
<ol class="org-ol">
<li><a id="org9be7ab8"></a>but does this really work? how can a decision TM be used to compute the function output efficiently?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span><br /></li>
</ol>
</li>
