docs/isos/intro_to_isos/KBe21isos201retStoryOfScienceComputationalComplexity.html
<li><a id="orgc90262d"></a>size of an instance<br />
<div class="outline-text-5" id="text-6-1-1-5">
<p>
Size is usually the length of the input. The complexity is a function of the input size, usually representing the worst case time or space (or any other complexity measure) required for any input size.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org2871f8d" class="outline-4">
<h4 id="org2871f8d"><span class="section-number-4">6.1.2</span> machine models and complexity measures</h4>
<div class="outline-text-4" id="text-6-1-2">
</div>
<ol class="org-ol">
<li><a id="orgb459654"></a>Turing machine<br />
<div class="outline-text-5" id="text-6-1-2-1">
<p>
standard Turing machine stuff. its very general. Many types of turing machines (probabilistic, non-deterministic, quantum, etc) are used to define different complexity classes.
</p>
</div>
</li>
<li><a id="org6f66e23"></a>other machine models&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span><br />
<div class="outline-text-5" id="text-6-1-2-2">
<p>
Other non-standard Turing machines are used, but the idea is that they aren't actually any better, somehow?
</p>
</div>
</li>
<li><a id="orgc14eb0b"></a>Complexity Measures<br />
<div class="outline-text-5" id="text-6-1-2-3">
<p>
Usually time or space, but any complexity measure that satisfies Blum's complexity axioms can be used. Examples include: communication complexity, circuit complexity.
</p>

<p>
Also constant factors don't really matter. And its usually the worst case.
</p>

<p>
Importantly, complexity measures are also a function of the type of Turing machine used, since some Turing machines are better in some scenarios.
</p>
</div>
<ol class="org-ol">
<li><a id="orgd5a9106"></a>blums complexity axioms&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span><br /></li>
</ol>
</li>
<li><a id="org42654ed"></a>best/worst/average case<br />
<div class="outline-text-5" id="text-6-1-2-4">
<p>
We generally talk about worst case complexity, but some algorithms have good average-case which is good enough (eg. quicksort). Generally, best-case &lt; average-case &lt; amortized analysis &lt; worst-case.
</p>
</div>
</li>
<li><a id="orga7a5921"></a>upper and lower bounds for problems<br />
<div class="outline-text-5" id="text-6-1-2-5">
<p>
Importantly, this is <b>not an upper or lower bound for an algorithm</b>. Instead, for problems in general, it's relatively easy to decide an upper bound (which is just the worst case complexity of any correct algorithm), but a lower bound is difficult (since it must involve algorithms that haven't been discovered yet).
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgdc457ae" class="outline-4">
<h4 id="orgdc457ae"><span class="section-number-4">6.1.3</span> complexity classes</h4>
<div class="outline-text-4" id="text-6-1-3">
</div>
<ol class="org-ol">
<li><a id="org2324e3a"></a>dependencies<br />
<div class="outline-text-5" id="text-6-1-3-1">
<p>
Complexity classes are a function of the following factors
</p>
</div>
<ol class="org-ol">
<li><a id="orgb9da6de"></a>problem type<br />
<div class="outline-text-6" id="text-6-1-3-1-1">
<p>
{ decision, function, counting, optimization, promise, etc }
</p>
</div>
</li>
<li><a id="org4479ca5"></a>computation model<br />
<div class="outline-text-6" id="text-6-1-3-1-2">
<p>
{ deterministic Turing machine, non-deterministic, Boolean circuits, quantum TM, monotone circuits, etc }
</p>
</div>
</li>
<li><a id="orgb9aaa42"></a>bounded resources<br />
<div class="outline-text-6" id="text-6-1-3-1-3">
<p>
{ polynomial time, logarithmic space, constant depth }
</p>
</div>
</li>
</ol>
</li>
<li><a id="orgb1a18d7"></a>an example definition<br />
<div class="outline-text-5" id="text-6-1-3-2">
<blockquote>
<p>
The set of decision problems solvable by a deterministic Turing machine within time f(n). (This complexity class is known as DTIME(f(n)).)
</p>
</blockquote>

<p>
However, using a concrete function \(f(n)\) is often computational-model-dependent, but the Cobham-Edmonds thesis states that 'the time complexities in any two reasonable general models of computation are polynomial related.'
</p>

<p>
This suggests that all if we want to be machine-independent, all polynomial problems are roughly the same and belong in the same class: P (for decision problems) and FP (for function problems).
</p>
</div>
<ol class="org-ol">
<li><a id="org8b71fdf"></a>why are there different classes if decision and function problems are the same-ish? dunno&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span><br /></li>
</ol>
</li>
<li><a id="org82a7e6f"></a>important complexity classes<br />
<div class="outline-text-5" id="text-6-1-3-3">
<p>
A nice list here but the complexity petting zoo is more friendly.
</p>
</div>
</li>
<li><a id="org2c51d0a"></a>Hierarchy theorems&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span><br />
<div class="outline-text-5" id="text-6-1-3-4">
<p>
We would like to establish a strict containment hierarchy within classes (but between different eg. polynomial functions). This does that, apparently?
</p>
</div>
</li>
<li><a id="org7ad405a"></a>Reduction<br />
<div class="outline-text-5" id="text-6-1-3-5">
<p>
Many problems can be turned into other problems in their class, which provides an upper bound on the difficulty of the problem.
</p>

<p>
There are many types of reductions, but the most common type is the polynomial-time reduction which means the reduction takes polynomial time. If you take a non-polynomial reduction to turn a problem into a polynomial problem, then you haven't proven anything.
</p>
</div>
<ol class="org-ol">
<li><a id="orgd1390b6"></a>hardness and completeness<br />
<div class="outline-text-6" id="text-6-1-3-5-1">
<p>
A problem \(X\) is hard for a class \(C\) if every problem in \(C\) can be reduced to \(X\). A problem \(X\) is complete for \(C\) if it is hard for \(C\) it is in \(C\). NP-complete problems are the "most difficult problems in NP" because other problems can be reduced to them.
</p>

<p>
Being able to reduce a hard problem to another problem shows that that other problem is just as hard, by contradiction. Similarly, being able to reduce a hard problem to a known easy one collapses the hierarchy.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
