docs/isos/intro_to_isos/KBe21isos201retStoryOfScienceComputationalComplexity.tex
\item size of an instance
\label{sec:orgdb7a74e}
Size is usually the length of the input. The complexity is a function of the input size, usually representing the worst case time or space (or any other complexity measure) required for any input size.
\end{enumerate}
\subsubsection{machine models and complexity measures}
\label{sec:orga96eac8}
\begin{enumerate}
\item Turing machine
\label{sec:orgcd8eb2e}
standard Turing machine stuff. its very general. Many types of turing machines (probabilistic, non-deterministic, quantum, etc) are used to define different complexity classes.
\item other machine models\hfill{}\textsc{toexpand}
\label{sec:org19eef5b}
Other non-standard Turing machines are used, but the idea is that they aren't actually any better, somehow?
\item Complexity Measures
\label{sec:org7e44bd0}
Usually time or space, but any complexity measure that satisfies Blum's complexity axioms can be used. Examples include: communication complexity, circuit complexity.

Also constant factors don't really matter. And its usually the worst case.

Importantly, complexity measures are also a function of the type of Turing machine used, since some Turing machines are better in some scenarios.
\begin{enumerate}
\item blums complexity axioms\hfill{}\textsc{toexpand}
\label{sec:orgc2456a4}
\end{enumerate}
\item best/worst/average case
\label{sec:orgf2faad8}
We generally talk about worst case complexity, but some algorithms have good average-case which is good enough (eg. quicksort). Generally, best-case < average-case < amortized analysis < worst-case.
\item upper and lower bounds for problems
\label{sec:org8a66b93}
Importantly, this is \textbf{not an upper or lower bound for an algorithm}. Instead, for problems in general, it's relatively easy to decide an upper bound (which is just the worst case complexity of any correct algorithm), but a lower bound is difficult (since it must involve algorithms that haven't been discovered yet).
\end{enumerate}
\subsubsection{complexity classes}
\label{sec:org2fe02fa}
\begin{enumerate}
\item dependencies
\label{sec:org1056ca2}
Complexity classes are a function of the following factors
\begin{enumerate}
\item problem type
\label{sec:org1d3d40e}
\{ decision, function, counting, optimization, promise, etc \}
\item computation model
\label{sec:org0125828}
\{ deterministic Turing machine, non-deterministic, Boolean circuits, quantum TM, monotone circuits, etc \}
\item bounded resources
\label{sec:org71f986e}
\{ polynomial time, logarithmic space, constant depth \}
\end{enumerate}
\item an example definition
\label{sec:orge75d66d}
\begin{quote}
The set of decision problems solvable by a deterministic Turing machine within time f(n). (This complexity class is known as DTIME(f(n)).)
\end{quote}

However, using a concrete function \(f(n)\) is often computational-model-dependent, but the Cobham-Edmonds thesis states that 'the time complexities in any two reasonable general models of computation are polynomial related.'

This suggests that all if we want to be machine-independent, all polynomial problems are roughly the same and belong in the same class: P (for decision problems) and FP (for function problems).
\begin{enumerate}
\item why are there different classes if decision and function problems are the same-ish? dunno\hfill{}\textsc{toexpand}
\label{sec:orgffbffd4}
\end{enumerate}
\item important complexity classes
\label{sec:org34ef4d6}
A nice list here but the complexity petting zoo is more friendly.
\item Hierarchy theorems\hfill{}\textsc{toexpand}
\label{sec:orgeebd754}
We would like to establish a strict containment hierarchy within classes (but between different eg. polynomial functions). This does that, apparently?
\item Reduction
\label{sec:org22d2935}
Many problems can be turned into other problems in their class, which provides an upper bound on the difficulty of the problem.

There are many types of reductions, but the most common type is the polynomial-time reduction which means the reduction takes polynomial time. If you take a non-polynomial reduction to turn a problem into a polynomial problem, then you haven't proven anything.
\begin{enumerate}
\item hardness and completeness
\label{sec:org3964377}
A problem \(X\) is hard for a class \(C\) if every problem in \(C\) can be reduced to \(X\). A problem \(X\) is complete for \(C\) if it is hard for \(C\) it is in \(C\). NP-complete problems are the "most difficult problems in NP" because other problems can be reduced to them.

Being able to reduce a hard problem to another problem shows that that other problem is just as hard, by contradiction. Similarly, being able to reduce a hard problem to a known easy one collapses the hierarchy.
\end{enumerate}
\end{enumerate}
