src/isos101/KBe21isos201retStoryOfScienceComputationalComplexity.org
**** P vs NP
	 If any NP-complete problem can be reduced (polynomially) to a P problem, then many NP problems would be solvable in polynomial time. There are many NP problems that we would like to solve efficiently, so this would be a big deal.

	 In fact, many of the other 'important open problems' are important because they would show that $P \neq  NP$.
**** NP-indeterminate problems (in NP but not in P nor NP-complete) :toexpand:
	 some theorem shows that if P neq NP then there are NP-indeterminate problems. If we show that there are none, then that proves P = NP. Some unclassified problems (graph isomorphism problem, integer factorization problem) being NP-complete would 'collapse the polynomial hierarchy.' ?????
**** separations between other complexity classes
	 There are many classes that are improper subsets of each other. If any of those relations can be shown to be a proper subset, then classes on either side would be unequal. For example, many such relations exist between P and NP and showing that one of those relations is a proper subset relation would prove that P != NP. Or, proving that two classes (eg. P, PSPACE) are equal would squish all classes in between into one (in this case, showing that P = NP).
*** Intractability
	Meaning "not handleable". The Cobham-Edmonds thesis suggests that all polynomial problems are tractable. However, in the real world, specific numbers matter ($N^{15}$ is much worse than $0.0001^N$)
*** continuous complexity theory                                   :toexpand:
	Something about continuous functions or analog logic.
*** History
**** Many foundations laid, eg. Turing machine in 1936 which allowed for analysis of various algorithms.
**** First systematic study attributed to Juris Hartmanis and Richard E. Stearns in "On the Computational Complexity of Algorithms" (1965)
**** Edmonds (Cobham-Edmonds thesis) suggests polynomial problems are "good" (1965)
**** other studies of problems with bounded resources in the previous few years
**** Blum axioms for complexity measures (1967), and the "speed-up theorem"
**** 1971 Stephen Cook and Leonid Levin proved existance of practically relevant NP-complete problems
**** Richard Karp (1972) showed 21 relevant and NP-complete problems (op)
***** oldest of four children, born to jewish family in Dorchester, Boston
***** mother got harvard degree at age 57 and father wanted to go on to medschool after Harvard but became a math teacher bc he couldn't afford med school
***** went to harvard, some career jumps, mostly CS professor at UC Berkeley
***** leads a number of societies and organizations, including International Computer Science Institute, Simons Institute for the Theory of Computing
***** and also got a bunch of prizes for his work on NP-complete problems
***** Edmonds-Karp algorithm for max flow with Jack Edmonds 1971
***** landmark NP-completeness paper in 1972
****** showed 21 problems that SAT can be reduced to
****** a nice tree of reducibility + some previous work mentioned in the paper
***** 1973 Hopcroft-karp algorithm with john hopcroft for bipartite graph max matchings
***** some other work later on
