docs/isos/intro_to_isos/KBe21isos201retStoryOfScienceComputationalComplexity.html
<div id="outline-container-org8b3d2da" class="outline-4">
<h4 id="org8b3d2da"><span class="section-number-4">6.1.4</span> important open problems</h4>
<div class="outline-text-4" id="text-6-1-4">
</div>
<ol class="org-ol">
<li><a id="orge4a62a1"></a>P vs NP<br />
<div class="outline-text-5" id="text-6-1-4-1">
<p>
If any NP-complete problem can be reduced (polynomially) to a P problem, then many NP problems would be solvable in polynomial time. There are many NP problems that we would like to solve efficiently, so this would be a big deal.
</p>

<p>
In fact, many of the other 'important open problems' are important because they would show that \(P \neq  NP\).
</p>
</div>
</li>
<li><a id="orgbbd345d"></a>NP-indeterminate problems (in NP but not in P nor NP-complete)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span><br />
<div class="outline-text-5" id="text-6-1-4-2">
<p>
some theorem shows that if P neq NP then there are NP-indeterminate problems. If we show that there are none, then that proves P = NP. Some unclassified problems (graph isomorphism problem, integer factorization problem) being NP-complete would 'collapse the polynomial hierarchy.' ?????
</p>
</div>
</li>
<li><a id="org01b3e93"></a>separations between other complexity classes<br />
<div class="outline-text-5" id="text-6-1-4-3">
<p>
There are many classes that are improper subsets of each other. If any of those relations can be shown to be a proper subset, then classes on either side would be unequal. For example, many such relations exist between P and NP and showing that one of those relations is a proper subset relation would prove that P != NP. Or, proving that two classes (eg. P, PSPACE) are equal would squish all classes in between into one (in this case, showing that P = NP).
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org7c8521e" class="outline-4">
<h4 id="org7c8521e"><span class="section-number-4">6.1.5</span> Intractability</h4>
<div class="outline-text-4" id="text-6-1-5">
<p>
Meaning "not handleable". The Cobham-Edmonds thesis suggests that all polynomial problems are tractable. However, in the real world, specific numbers matter (\(N^{15}\) is much worse than \(0.0001^N\))
</p>
</div>
</div>
<div id="outline-container-org86af396" class="outline-4">
<h4 id="org86af396"><span class="section-number-4">6.1.6</span> continuous complexity theory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="toexpand">toexpand</span></span></h4>
<div class="outline-text-4" id="text-6-1-6">
<p>
Something about continuous functions or analog logic.
</p>
</div>
</div>
<div id="outline-container-orga6f535a" class="outline-4">
<h4 id="orga6f535a"><span class="section-number-4">6.1.7</span> History</h4>
<div class="outline-text-4" id="text-6-1-7">
</div>
<ol class="org-ol">
<li><a id="org4fa2949"></a>Many foundations laid, eg. Turing machine in 1936 which allowed for analysis of various algorithms.<br /></li>
<li><a id="orgbee0da2"></a>First systematic study attributed to Juris Hartmanis and Richard E. Stearns in "On the Computational Complexity of Algorithms" (1965)<br /></li>
<li><a id="orgb575921"></a>Edmonds (Cobham-Edmonds thesis) suggests polynomial problems are "good" (1965)<br /></li>
<li><a id="org63f8aef"></a>other studies of problems with bounded resources in the previous few years<br /></li>
<li><a id="orgbba7c91"></a>Blum axioms for complexity measures (1967), and the "speed-up theorem"<br /></li>
<li><a id="org1fecea5"></a>1971 Stephen Cook and Leonid Levin proved existance of practically relevant NP-complete problems<br /></li>
<li><a id="orge27204d"></a>Richard Karp (1972) showed 21 relevant and NP-complete problems (op)<br />
<ol class="org-ol">
<li><a id="org565d739"></a>oldest of four children, born to jewish family in Dorchester, Boston<br /></li>
<li><a id="org2b455aa"></a>mother got harvard degree at age 57 and father wanted to go on to medschool after Harvard but became a math teacher bc he couldn't afford med school<br /></li>
<li><a id="orgeb9411a"></a>went to harvard, some career jumps, mostly CS professor at UC Berkeley<br /></li>
<li><a id="org713c05b"></a>leads a number of societies and organizations, including International Computer Science Institute, Simons Institute for the Theory of Computing<br /></li>
<li><a id="org811c7e8"></a>and also got a bunch of prizes for his work on NP-complete problems<br /></li>
<li><a id="org2447305"></a>Edmonds-Karp algorithm for max flow with Jack Edmonds 1971<br /></li>
<li><a id="orgaedf470"></a>landmark NP-completeness paper in 1972<br />
<ol class="org-ol">
<li><a id="org8eb1082"></a>showed 21 problems that SAT can be reduced to<br /></li>
<li><a id="orgacc030e"></a>a nice tree of reducibility + some previous work mentioned in the paper<br /></li>
</ol>
</li>
<li><a id="orga1a515d"></a>1973 Hopcroft-karp algorithm with john hopcroft for bipartite graph max matchings<br /></li>
<li><a id="org66ec4d3"></a>some other work later on<br />
<div class="outline-text-6" id="text-6-1-7-7-9">
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
