docs/isos/intro_to_isos/KBe21isos201retStoryOfScienceComputationalComplexity.tex
\subsubsection{important open problems}
\label{sec:orgefd3d43}
\begin{enumerate}
\item P vs NP
\label{sec:org5424454}
If any NP-complete problem can be reduced (polynomially) to a P problem, then many NP problems would be solvable in polynomial time. There are many NP problems that we would like to solve efficiently, so this would be a big deal.

In fact, many of the other 'important open problems' are important because they would show that \(P \neq  NP\).
\item NP-indeterminate problems (in NP but not in P nor NP-complete)\hfill{}\textsc{toexpand}
\label{sec:org5e7f0ec}
some theorem shows that if P neq NP then there are NP-indeterminate problems. If we show that there are none, then that proves P = NP. Some unclassified problems (graph isomorphism problem, integer factorization problem) being NP-complete would 'collapse the polynomial hierarchy.' ?????
\item separations between other complexity classes
\label{sec:org130430f}
There are many classes that are improper subsets of each other. If any of those relations can be shown to be a proper subset, then classes on either side would be unequal. For example, many such relations exist between P and NP and showing that one of those relations is a proper subset relation would prove that P != NP. Or, proving that two classes (eg. P, PSPACE) are equal would squish all classes in between into one (in this case, showing that P = NP).
\end{enumerate}
\subsubsection{Intractability}
\label{sec:org10afb99}
Meaning "not handleable". The Cobham-Edmonds thesis suggests that all polynomial problems are tractable. However, in the real world, specific numbers matter (\(N^{15}\) is much worse than \(0.0001^N\))
\subsubsection{continuous complexity theory\hfill{}\textsc{toexpand}}
\label{sec:orgd833315}
Something about continuous functions or analog logic.
\subsubsection{History}
\label{sec:org9a86645}
\begin{enumerate}
\item Many foundations laid, eg. Turing machine in 1936 which allowed for analysis of various algorithms.
\label{sec:org4878f24}
\item First systematic study attributed to Juris Hartmanis and Richard E. Stearns in "On the Computational Complexity of Algorithms" (1965)
\label{sec:org2e4f05f}
\item Edmonds (Cobham-Edmonds thesis) suggests polynomial problems are "good" (1965)
\label{sec:orgbd843c4}
\item other studies of problems with bounded resources in the previous few years
\label{sec:orge5a9c25}
\item Blum axioms for complexity measures (1967), and the "speed-up theorem"
\label{sec:orge5abf4a}
\item 1971 Stephen Cook and Leonid Levin proved existance of practically relevant NP-complete problems
\label{sec:orgaf9bcb9}
\item Richard Karp (1972) showed 21 relevant and NP-complete problems (op)
\label{sec:orgb6b7705}
\begin{enumerate}
\item oldest of four children, born to jewish family in Dorchester, Boston
\label{sec:org2970dd5}
\item mother got harvard degree at age 57 and father wanted to go on to medschool after Harvard but became a math teacher bc he couldn't afford med school
\label{sec:orgf55fc05}
\item went to harvard, some career jumps, mostly CS professor at UC Berkeley
\label{sec:org52bf4b3}
\item leads a number of societies and organizations, including International Computer Science Institute, Simons Institute for the Theory of Computing
\label{sec:org2c10492}
\item and also got a bunch of prizes for his work on NP-complete problems
\label{sec:orgeafb58a}
\item Edmonds-Karp algorithm for max flow with Jack Edmonds 1971
\label{sec:org67f8256}
\item landmark NP-completeness paper in 1972
\label{sec:org157c9df}
\begin{enumerate}
\item showed 21 problems that SAT can be reduced to
\label{sec:org1a9f8d8}
\item a nice tree of reducibility + some previous work mentioned in the paper
\label{sec:org75380a0}
\end{enumerate}
\item 1973 Hopcroft-karp algorithm with john hopcroft for bipartite graph max matchings
\label{sec:org3985683}
\item some other work later on
\label{sec:orgb630a6f}
\end{enumerate}
\end{enumerate}
\end{document}
